In [2]:
# Import libraries
import pandas as pd
import numpy as np

from glob import glob

In [12]:
# Here we will take a look at the description Excel sheet to understand our data better.
# 
df_description =  pd.read_excel('Data/CDR_description.xlsx')

df_description.head(12)


# from the output we see the needed columns and the ones to be dropped
#  we can also see the columns to change names enabling us to make our identifiers known easily.
# Also shows the data types

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [4]:
# Here we take a look at our cells location file.
# 


df_cellgeo = pd.read_csv('Data\cells_geo.csv', sep=";", encoding='utf-8')

df_cellgeo.head(5)

,Unnamed: 0,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [5]:
# we load the csv containing the data sets
# With a data preview

tel1 = pd.read_csv('Data\Telcom_dataset.csv', delimiter= ',',encoding= 'utf8')
tel1

tel1.columns = ['Product', 'Bill_Price','Date_time', 'Cell_onsite','DW_A','DW_B', 'Country_A','Country_B','Cell_id', 'Site_id']

tel1.head()

,Product,Bill_Price,Date_time,Cell_onsite,DW_A,DW_B,Country_A,Country_B,Cell_id,Site_id
0,Voice,0,2012-05-06 23:04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [6]:
# Second data set.
# With a data preview

tel2 = pd.read_csv('Data\Telcom_dataset2.csv', delimiter= ',',encoding= 'utf8')
tel1

tel2.columns = ['Product', 'Bill_Price','Date_time', 'Cell_onsite','DW_A','DW_B', 'Country_A','Country_B','Cell_id', 'Site_id']

tel2.head()

,Product,Bill_Price,Date_time,Cell_onsite,DW_A,DW_B,Country_A,Country_B,Cell_id,Site_id
0,sms,0,2012-05-07 23:02:06.0,2,32255675c3b6fe3,1aa7ae01386e9fb,19e2e,19e2e,+854AcBQT2,+854AcBQT2
1,Voice,0,2012-05-07 23:03:44.0,1,ff16d6ac74c1c64,87d87309c15a8c9,19e2e,19e2e,+854AcBQT2,+854AcBQT2
2,sms,0,2012-05-07 23:04:06.0,0,98d9f2fb5ff624b,93343ba6e41af95,19e2e,19e2e,+laSrk7g6q,+laSrk7g6q
3,Voice,37,2012-05-07 23:04:48.0,1,3f9c8a33ec7be1f,7d05a38f89c49d8,19e2e,19e2e,/xvRrCVKoQ,/xvRrCVKoQ
4,sms,25,2012-05-07 23:04:58.0,1,7bcccc03adf3864,56a5d5430d2fa86,19e2e,19e2e,+bO+qkSonO,+bO+qkSonO

In [7]:
# For our third data set.
# With a data preview

tel3 = pd.read_csv('Data\Telcom_dataset3.csv', delimiter= ',',encoding= 'utf8')
tel3

tel3.columns = ['Product', 'Bill_Price','Date_time', 'Cell_onsite','DW_A','DW_B', 'Country_A','Country_B','Cell_id', 'Site_id']

tel3.head()

,Product,Bill_Price,Date_time,Cell_onsite,DW_A,DW_B,Country_A,Country_B,Cell_id,Site_id
0,Voice,61,2012-05-08 23:01:28.0,2,966f68353622feb,ffd53a3bb2db6f1,19e2e,19e2e,+38u2u/rfx,+38u2u/rfx
1,sms,0,2012-05-08 23:01:31.0,1,a0a597384c612d7,cf3b218f1dde792,19e2e,19e2e,+Fs4mTvdKx,+Fs4mTvdKx
2,Voice,10,2012-05-08 23:02:59.0,1,5441a9a58c97132,52f8b299515b9b7,19e2e,19e2e,+ZaaZozy/+,+ZaaZozy/+
3,sms,0,2012-05-08 23:03:04.0,0,8ab8b9ed6989f61,e09e736e46c5c3d,19e2e,19e2e,+cNeJzsTp3,+cNeJzsTp3
4,Voice,22,2012-05-08 23:03:16.0,4,52662a62b199334,2186273faab4602,19e2e,19e2e,/eeMklgyJA,/eeMklgyJA

In [11]:
# We should clean the data frames for any duplicates in the data and also
#  Removing missing values and droppping uneccesary columns as per our guide on the Description

# Start with df_cellgeo
# Check to see info details
#  Step two check for duplicates and missing values
# 
df_cellgeo.info()

df_cellgeo.duplicated().value_counts()

# Check for missing values
df_cellgeo.isnull().sum().sort_values(ascending=False)


# Drop Duplicates
df_cellgeo.drop_duplicates(inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3974 non-null   int64
 1   VILLES        3974 non-null   object
 2   STATUS        3907 non-null   object
 3   LOCALISATION  3974 non-null   object
 4   DECOUPZONE    3974 non-null   object
 5   ZONENAME      3968 non-null   object
 6   LONGITUDE     3974 non-null   float64
 7   LATITUDE      3974 non-null   float64
 8   REGION        3974 non-null   object
 9   AREA          3951 non-null   object
 10  CELL_ID       3974 non-null   object
 11  SITE_CODE     3974 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.7+ KB

In [13]:
# Now for Our datasets
# Check to see info details
#  Step two check for duplicates and missing values
# 
tel1.info()

tel1.duplicated().value_counts()

# Check for missing values
tel1.isnull().sum().sort_values(ascending=False)


# Drop Duplicates
tel1.drop_duplicates(inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      5001 non-null   object
 1   Bill_Price   5001 non-null   int64
 2   Date_time    5001 non-null   object
 3   Cell_onsite  5001 non-null   object
 4   DW_A         5001 non-null   object
 5   DW_B         5001 non-null   object
 6   Country_A    5001 non-null   object
 7   Country_B    5001 non-null   object
 8   Cell_id      5001 non-null   object
 9   Site_id      4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [14]:
# Now for Our datasets
# Check to see info details
#  Step two check for duplicates and missing values
# 
tel2.info()

tel2.duplicated().value_counts()

# Check for missing values
tel2.isnull().sum().sort_values(ascending=False)


# Drop Duplicates
tel2.drop_duplicates(inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      5001 non-null   object
 1   Bill_Price   5001 non-null   int64
 2   Date_time    5001 non-null   object
 3   Cell_onsite  5001 non-null   object
 4   DW_A         5001 non-null   object
 5   DW_B         5001 non-null   object
 6   Country_A    5001 non-null   object
 7   Country_B    5001 non-null   object
 8   Cell_id      5001 non-null   object
 9   Site_id      4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [15]:
# Now for Our datasets
# Check to see info details
#  Step two check for duplicates and missing values
# 
tel3.info()

tel3.duplicated().value_counts()

# Check for missing values
tel3.isnull().sum().sort_values(ascending=False)


# Drop Duplicates
tel3.drop_duplicates(inplace=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      5001 non-null   object
 1   Bill_Price   5001 non-null   int64
 2   Date_time    5001 non-null   object
 3   Cell_onsite  5001 non-null   object
 4   DW_A         5001 non-null   object
 5   DW_B         5001 non-null   object
 6   Country_A    5001 non-null   object
 7   Country_B    5001 non-null   object
 8   Cell_id      5001 non-null   object
 9   Site_id      4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [16]:
# Now that the datasets are cleaned up we can now join them into one sheet
# 

master_datasets =  pd.concat([tel1,tel2,tel3], axis=0, join='outer',ignore_index=True)

master_datasets.head(10)

,Product,Bill_Price,Date_time,Cell_onsite,DW_A,DW_B,Country_A,Country_B,Cell_id,Site_id
0,Voice,0,2012-05-06 23:04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv
5,data,0,2012-05-06 23:07:26.0,_,f71825ca6e623f9,5a4dc9e82deb309,19e2e,OTHER,/lrUXVGVcN,/lrUXVGVcN
6,Voice,0,2012-05-06 23:08:02.0,1,4afd7d5af21b1ce,67bf1ac30e58e2f,19e2e,19e2e,+38u2u/rfx,+38u2u/rfx
7,Voice,0,2012-05-06 23:08:03.0,5,d717dee81c51389,adde5afd9a67b10,19e2e,19e2e,09UjmmY1Ds,09UjmmY1Ds
8,Voice,0,2012-05-06 23:08:05.0,1,44522aefdc918a6,19e68e80103885e,19e2e,19e2e,0DeimCpZOc,0DeimCpZOc
9,sms,0,2012-05-06 23:08:43.0,0,0763a571d24db64,f773694c00c74d2,19e2e,19e2e,01MDiY5F89,01MDiY5F89

In [17]:
# We can take a look at some info on the merged data
# To seek out where our data points are.
# We will need to drop some columns since they are not needed.

master_datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14750 entries, 0 to 14749
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      14750 non-null  object
 1   Bill_Price   14750 non-null  int64
 2   Date_time    14750 non-null  object
 3   Cell_onsite  14750 non-null  object
 4   DW_A         14750 non-null  object
 5   DW_B         14750 non-null  object
 6   Country_A    14750 non-null  object
 7   Country_B    14750 non-null  object
 8   Cell_id      14750 non-null  object
 9   Site_id      12789 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.1+ MB

In [26]:
# Dropping columns on the master Data set.
# 
master_datasets.drop("Cell_onsite", axis=1, inplace=True)
master_datasets.drop("Country_A", axis=1, inplace=True)
master_datasets.drop("Country_B", axis=1, inplace=True)

,Product,Bill_Price,Date_time,DW_A,DW_B,Cell_id,Site_id
0,Voice,0,2012-05-06 23:04:37.0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv

In [27]:
# To preview changes
master_datasets.head()

,Product,Bill_Price,Date_time,DW_A,DW_B,Cell_id,Site_id
0,Voice,0,2012-05-06 23:04:37.0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,2012-05-06 23:05:25.0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41
2,sms,25,2012-05-06 23:05:41.0,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,2012-05-06 23:05:42.0,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3
4,Voice,14,2012-05-06 23:06:29.0,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv

In [30]:
# We will splite date and time just to have a better master dataset
# 

master_datasets[['Date', 'time']] = master_datasets.Date_time.str.split(expand=True)
master_datasets.head()

,Product,Bill_Price,Date_time,DW_A,DW_B,Cell_id,Site_id,Date,time
0,Voice,0,2012-05-06 23:04:37.0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu,2012-05-06,23:04:37.0
1,sms,0,2012-05-06 23:05:25.0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41,2012-05-06,23:05:25.0
2,sms,25,2012-05-06 23:05:41.0,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi,2012-05-06,23:05:41.0
3,Voice,56,2012-05-06 23:05:42.0,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3,2012-05-06,23:05:42.0
4,Voice,14,2012-05-06 23:06:29.0,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv,2012-05-06,23:06:29.0

In [31]:
# Then we an drop the combined date and time column
# 
master_datasets.drop("Date_time", axis=1, inplace=True)
master_datasets.head()

,Product,Bill_Price,DW_A,DW_B,Cell_id,Site_id,Date,time
0,Voice,0,49fae048b547780,1a49f8b0ded9de6,/TJNe+Mmtu,/TJNe+Mmtu,2012-05-06,23:04:37.0
1,sms,0,7a54a6eaee19e65,93343ba6e41af95,/+cKZKIp41,/+cKZKIp41,2012-05-06,23:05:25.0
2,sms,25,6008887b0207d82,7aacc9709ce0a20,/u0FSD+ahi,/u0FSD+ahi,2012-05-06,23:05:41.0
3,Voice,56,7370032e20f4e96,6af4a60e74c91d3,+cNeJzsTp3,+cNeJzsTp3,2012-05-06,23:05:42.0
4,Voice,14,966ba4656e38e62,02aa736ee555d5c,051KhYDCpv,051KhYDCpv,2012-05-06,23:06:29.0

In [32]:
# We need to preview the Cells geo location files to check whether it is okay for merging with 
# the master dataset.

df_cellgeo.head()

,Unnamed: 0,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [33]:
# We can drop one uneeded column called Unamed since it will not affect our data points.
# 

df_cellgeo.drop('Unnamed: 0', axis=1, inplace=True)

In [34]:
# we check for changes
# 

df_cellgeo.tail()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
3969,ZUENOULA,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-6.039694,7.428611,MARAHOUE,CENTRE NORTH,1cfc2d7ab1,f91ed8d2e9
3970,ZUENOULA,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-6.039694,7.428611,MARAHOUE,CENTRE NORTH,3ae1708153,f91ed8d2e9
3971,ZUENOULA,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-6.065450,7.444592,MARAHOUE,CENTRE NORTH,cb71f8a29c,61bee9c70c
3972,ZUENOULA,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-6.065450,7.444592,MARAHOUE,CENTRE NORTH,d4a6a0b645,61bee9c70c
3973,ZUENOULA,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-6.065450,7.444592,MARAHOUE,CENTRE NORTH,f9f3e42589,61bee9c70c

In [35]:
# Now we can merge with the master data sets.
# we have two identical columns so we have to combine them

mergedmaster = pd.merge(master_datasets, df_cellgeo, how='inner',left_on="Site_id",right_on="SITE_CODE")

In [36]:
# Preview changes to our final data set.
# 

mergedmaster.head()

,Product,Bill_Price,DW_A,DW_B,Cell_id,Site_id,Date,time,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,24ccdda3d5,1b5540c02d
1,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ebfc58af70,1b5540c02d
2,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ba8ce6e4ef,1b5540c02d
3,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,c2545171dc,1b5540c02d
4,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,5d9dc897f7,1b5540c02d,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,f15bd5483f,1b5540c02d

In [37]:
# We need to drop Identical column
# 
to_drop = ['Cell_id','Site_id']
mergedmaster.drop(to_drop, axis=1, inplace=True)

In [38]:
# Check for changes
# We have succesfully clean our data now we can sample out what we need.

mergedmaster.head()

,Product,Bill_Price,DW_A,DW_B,Date,time,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,24ccdda3d5,1b5540c02d
1,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ebfc58af70,1b5540c02d
2,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,ba8ce6e4ef,1b5540c02d
3,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,c2545171dc,1b5540c02d
4,sms,0,8118c3aa53d6c7b,1d103ea638ad1f0,2012-05-07,00:00:00.0,BOUAKE,In Service,INTERIEUR,Grand-NORD,ZONE A - Grand-NORD,-5.027139,7.718417,VALLEE DU BANDAMA,CENTRE NORTH,f15bd5483f,1b5540c02d